CSI API ETABS v1
cGenDispl.GetTypeGenDispl Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTypeGenDispl(
	string Name,
	ref int MyType
)
Function GetTypeGenDispl (
	Name As String,
	ByRef MyType As Integer
) As Integer
Dim instance As cGenDispl
Dim Name As String
Dim MyType As Integer
Dim returnValue As Integer
returnValue = instance.GetTypeGenDispl(Name,
	MyType)
int GetTypeGenDispl(
	String^ Name,
	int% MyType
)
abstract GetTypeGenDispl :
        Name : string *
        MyType : int byref -> int
Parameters
Name
Type: System.String
MyType
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
cGenDispl Interface
ETABSv1 Namespace